InformationRegisters/СпособОценкиЗапасовБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СпособОценкиЗапасовБУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетЗапасов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыОценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
					<Comment>First input, first output (первым пришел, первым обработан)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
					<Comment>Last input, first output (последним пришел, первым обработан)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СпособОценкиЗапасовБУ/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Отказ = НЕ ДоступноУдалениеЗаписи(ТекущиеДанные.СчетЗапасов, ТекущиеДанные.СпособОценки);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервереБезКонтекста
Функция ДоступноУдалениеЗаписи(СчетЗапасов, СпособОценки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
    |	ТиповойОбороты.Счет,
    |	ТиповойОбороты.СуммаОборотДт
    |ИЗ
    |	РегистрБухгалтерии.Типовой.Обороты(, , , Счет = &Счет, , , , ) КАК ТиповойОбороты";
	Запрос.УстановитьПараметр("Счет", СчетЗапасов);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя удалять способ оценки запасов, т.к. существуют проведенные документы.'");
	КонецЕсли;
	
	Объект = СчетЗапасов.ПолучитьОбъект();
	
	Субконто = Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Партии, "ВидСубконто");

	Если Субконто <> Неопределено Тогда
		Если СпособОценки = Перечисления.СпособыОценки.ЛИФО ИЛИ СпособОценки = Перечисления.СпособыОценки.ФИФО Тогда 

			Объект.ВидыСубконто.Удалить(Субконто);
			ТекстСообщения = НСтр("ru = 'Для счета %1 удалено субконто ""Партии""'");
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СчетЗапасов));

		КонецЕсли;
		Объект.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
